Autodesk.Revit.DB.FamilyInstanceFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new instance of a filter to match family instances of the given family symbol.
document:
The document. This requirement is unique to this filter and is needed to ensure the input
family symbol id is valid for the provided document. This ensures the most stability and
greatest performance for this filter.
familySymbolId:
The family symbol id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The familySymbolId does not represent a valid FamilySymbol record in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011